In [1]:
import numpy as np
import pandas as pd
import joblib
import requests

In [2]:
df_kaggle = pd.read_csv("../data/kaggle/movies_metadata.csv")

/home/alo-reza/.pyenv/versions/3.6.6/envs/pygpu/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3051: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
df_kaggle.columns

Index(['adult', 'belongs_to_collection', 'budget', 'genres', 'homepage', 'id',
       'imdb_id', 'original_language', 'original_title', 'overview',
       'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'video',
       'vote_average', 'vote_count'],
      dtype='object')

In [4]:
df_kaggle[df_kaggle['revenue']!=0].shape,df_kaggle.shape

((7414, 24), (45466, 24))

In [5]:
df = joblib.load("data.pkl")

In [6]:
df[df['new_revenue']!=0].shape,df.shape

((8671, 3), (46628, 3))

df_ = df.merge(df_kaggle,on='title',how='left')
df_.shape
df_[df_.duplicated(subset='title')]
df_[df_['title']=="Heat"]

In [7]:
zero_revenue_movie = list(df[df["new_revenue"]==0]["title"].values)

In [18]:
df_kaggle[df_kaggle["title"]=="Heat"][["title","revenue"]]

      title      revenue
5      Heat  187436818.0
14684  Heat          0.0
29042  Heat          0.0

In [19]:
df[df['title']=="Heat"]

          id title  new_revenue
5        949  Heat  187436818.0
14856   4579  Heat          0.0
29255  42023  Heat    2793214.0

In [52]:
df[df['id'].duplicated(subset=["id"])]

TypeError: duplicated() got an unexpected keyword argument 'subset'

In [20]:
URL = "https://api.themoviedb.org/3/movie/{}?api_key=2d8e3000e80b3a5a64a5ff5ecce0ad7e".format(949)
r = requests.get(url = URL)
data = r.json()
data

{'adult': False,
 'backdrop_path': '/rfEXNlql4CafRmtgp2VFQrBC4sh.jpg',
 'belongs_to_collection': None,
 'budget': 60000000,
 'genres': [{'id': 28, 'name': 'Action'},
  {'id': 80, 'name': 'Crime'},
  {'id': 18, 'name': 'Drama'},
  {'id': 53, 'name': 'Thriller'}],
 'homepage': '',
 'id': 949,
 'imdb_id': 'tt0113277',
 'original_language': 'en',
 'original_title': 'Heat',
 'overview': 'Obsessive master thief, Neil McCauley leads a top-notch crew on various daring heists throughout Los Angeles while determined detective, Vincent Hanna pursues him without rest. Each man recognizes and respects the ability and the dedication of the other even though they are aware their cat-and-mouse game may end in violence.',
 'popularity': 20.798,
 'poster_path': '/rrBuGu0Pjq7Y2BWSI6teGfZzviY.jpg',
 'production_companies': [{'id': 508,
   'logo_path': '/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png',
   'name': 'Regency Enterprises',
   'origin_country': 'US'},
  {'id': 675,
   'logo_path': None,
   'name': 'Forward Pass',
   'origin_country': 'US'},
  {'id': 174,
   'logo_path': '/IuAlhI9eVC9Z8UQWOIDdWRKSEJ.png',
   'name': 'Warner Bros. Pictures',
   'origin_country': 'US'}],
 'production_countries': [{'iso_3166_1': 'US',
   'name': 'United States of America'}],
 'release_date': '1995-12-15',
 'revenue': 187436818,
 'runtime': 170,
 'spoken_languages': [{'iso_639_1': 'en', 'name': 'English'},
  {'iso_639_1': 'es', 'name': 'Español'}],
 'status': 'Released',
 'tagline': 'A Los Angeles Crime Saga',
 'title': 'Heat',
 'video': False,
 'vote_average': 7.9,
 'vote_count': 4101}

In [21]:
URL = "https://api.themoviedb.org/3/movie/{}?api_key=2d8e3000e80b3a5a64a5ff5ecce0ad7e".format(4579)
r = requests.get(url = URL)
data = r.json()
data

{'adult': False,
 'backdrop_path': '/pmgfg7wzPvIFodwEIPuvTODQNog.jpg',
 'belongs_to_collection': None,
 'budget': 0,
 'genres': [{'id': 35, 'name': 'Comedy'}, {'id': 18, 'name': 'Drama'}],
 'homepage': '',
 'id': 4579,
 'imdb_id': 'tt0068688',
 'original_language': 'en',
 'original_title': 'Heat',
 'overview': "Former child star Joe Davis, reduced to living in a cheap Hollywood motel while struggling for acting jobs, is lusted after by nearly every woman he meets, including Jessica Todd, a tightly wound feminist who has recently come out as a lesbian. When Jessica's mother, Sally, an emotionally needy has-been actress, meets Joe, she moves him into her enormous, tacky mansion as her new boy toy and attempts to get him acting work.",
 'popularity': 3.71,
 'poster_path': '/tryvx6s8abwdJVj45DHjFSxiKZD.jpg',
 'production_companies': [{'id': 10001,
   'logo_path': None,
   'name': 'Andy Warhol Productions',
   'origin_country': ''}],
 'production_countries': [{'iso_3166_1': 'US',
   'name': 'United States of America'}],
 'release_date': '1972-10-06',
 'revenue': 0,
 'runtime': 102,
 'spoken_languages': [{'iso_639_1': 'en', 'name': 'English'}],
 'status': 'Released',
 'tagline': '',
 'title': 'Heat',
 'video': False,
 'vote_average': 6.2,
 'vote_count': 16}

In [22]:
kaggle = pd.read_csv("../movie dataset/kaggle src/train.csv")

In [23]:
kaggle.shape

(3000, 23)

In [25]:
kaggle[kaggle["revenue"]!=0].shape,df[df['new_revenue']!=0].shape

((3000, 23), (8671, 3))

In [26]:
kaggle[kaggle['title'].isin(zero_revenue_movie)].shape

(363, 23)

In [35]:
df[df["title"]=="Safe"]

          id title  new_revenue
187    32646  Safe          0.0
19096  72387  Safe   40346186.0

In [40]:
kaggle[(kaggle['title'].isin(zero_revenue_movie))][["title","revenue"]]

                    title   revenue
2                Whiplash  13092000
17    The Invisible Woman   1234254
24            Black Sheep   4947717
35                   Safe  40346186
62                 Fallen  25232289
...                   ...       ...
2974    Alone in the Dark  10442808
2983        Anna Karenina    791830
2986            Paparazzi  16605763
2992  The Thief of Bagdad   1213880
2999            Abduction  82087155

[363 rows x 2 columns]

In [47]:
kaggle.isnull().sum()

id                          0
belongs_to_collection    2396
budget                      0
genres                      7
homepage                 2054
imdb_id                     0
original_language           0
original_title              0
overview                    8
popularity                  0
poster_path                 1
production_companies      156
production_countries       55
release_date                0
runtime                     2
spoken_languages           20
status                      0
tagline                   597
title                       0
Keywords                  276
cast                       13
crew                       16
revenue                     0
dtype: int64

In [36]:
zenodo = pd.read_csv("../movie dataset/zenodo src/movies.csv",delimiter=";")

/home/alo-reza/.pyenv/versions/3.6.6/envs/pygpu/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3051: DtypeWarning: Columns (7) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [37]:
zenodo.columns

Index(['id', 'budget', 'genres', 'imdb_id', 'original_language',
       'original_title', 'overview', 'popularity', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'vote_average',
       'vote_count', 'production_companies_number',
       'production_countries_number', 'spoken_languages_number'],
      dtype='object')

In [38]:
zenodo[zenodo["revenue"]!=0].shape,zenodo.shape

((8690, 22), (329044, 22))

In [41]:
zenodo[(zenodo["title"].isin(zero_revenue_movie)) & (zenodo["revenue"]!=0)][["title","revenue"]]

                 title    revenue
26          Unforgiven  159157447
48                Hero  177394432
56       Dirty Dancing  213954274
63          Armageddon  553799566
103            Dracula    1012189
...                ...        ...
307159          Thirst      10130
314610  The Best Movie         10
321624          Sultan        500
324662        Jailbait    7436000
327921             Run       1000

[983 rows x 2 columns]

In [49]:
df[df["title"]=="Sultan"]

           id   title  new_revenue
40663  376812  Sultan  102000000.0
44641  452606  Sultan          0.0